workloads/YCSB_rocksdb/luma_test_logs/record_size_workloadA_logs/scext4_8dev_512KB
<YCSB RocksDB benchmark script>
load YCSB-a x1 & run YCSB-a x10..
*---------------------------------- ycsb load ----------------------------------*
[OVERALL], RunTime(ms), 86169
[OVERALL], Throughput(ops/sec), 464.20406410658126
[TOTAL_GCS_G1_Young_Generation], Count, 47
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 617
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7160347688844015
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 47
[TOTAL_GC_TIME], Time(ms), 617
[TOTAL_GC_TIME_%], Time(%), 0.7160347688844015
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 8704.5
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 557055
[CLEANUP], 95thPercentileLatency(us), 12
[CLEANUP], 99thPercentileLatency(us), 28
[INSERT], Operations, 40000
[INSERT], AverageLatency(us), 136652.050875
[INSERT], MinLatency(us), 2890
[INSERT], MaxLatency(us), 4366335
[INSERT], 95thPercentileLatency(us), 101567
[INSERT], 99thPercentileLatency(us), 3407871
[INSERT], Return=OK, 40000
*---------------------------------- ycsb load end ------------------------------*
*---------------------------------- ycsb run_1 ----------------------------------*
[OVERALL], RunTime(ms), 35669
[OVERALL], Throughput(ops/sec), 1121.4219630491464
[TOTAL_GCS_G1_Young_Generation], Count, 37
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 541
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.5167232050239705
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 37
[TOTAL_GC_TIME], Time(ms), 541
[TOTAL_GC_TIME_%], Time(%), 1.5167232050239705
[READ], Operations, 20126
[READ], AverageLatency(us), 9455.26090629037
[READ], MinLatency(us), 161
[READ], MaxLatency(us), 122623
[READ], 95thPercentileLatency(us), 20767
[READ], 99thPercentileLatency(us), 42111
[READ], Return=OK, 20126
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 8341.96875
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 533503
[CLEANUP], 95thPercentileLatency(us), 21
[CLEANUP], 99thPercentileLatency(us), 23
[UPDATE], Operations, 19874
[UPDATE], AverageLatency(us), 97573.42014692564
[UPDATE], MinLatency(us), 1527
[UPDATE], MaxLatency(us), 1509375
[UPDATE], 95thPercentileLatency(us), 126975
[UPDATE], 99thPercentileLatency(us), 570879
[UPDATE], Return=OK, 19874
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_2 ----------------------------------*
[OVERALL], RunTime(ms), 48866
[OVERALL], Throughput(ops/sec), 818.5650554577825
[TOTAL_GCS_G1_Young_Generation], Count, 39
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 615
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.2585437727663407
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 39
[TOTAL_GC_TIME], Time(ms), 615
[TOTAL_GC_TIME_%], Time(%), 1.2585437727663407
[READ], Operations, 20200
[READ], AverageLatency(us), 8424.826138613862
[READ], MinLatency(us), 152
[READ], MaxLatency(us), 125759
[READ], 95thPercentileLatency(us), 18847
[READ], 99thPercentileLatency(us), 29471
[READ], Return=OK, 20200
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 6913.140625
[CLEANUP], MinLatency(us), 5
[CLEANUP], MaxLatency(us), 441599
[CLEANUP], 95thPercentileLatency(us), 36
[CLEANUP], 99thPercentileLatency(us), 55
[UPDATE], Operations, 19800
[UPDATE], AverageLatency(us), 142098.39469696968
[UPDATE], MinLatency(us), 1762
[UPDATE], MaxLatency(us), 2820095
[UPDATE], 95thPercentileLatency(us), 229887
[UPDATE], 99thPercentileLatency(us), 2040831
[UPDATE], Return=OK, 19800
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_3 ----------------------------------*
[OVERALL], RunTime(ms), 35313
[OVERALL], Throughput(ops/sec), 1132.7273242148783
[TOTAL_GCS_G1_Young_Generation], Count, 43
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 421
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.1921955087361595
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 43
[TOTAL_GC_TIME], Time(ms), 421
[TOTAL_GC_TIME_%], Time(%), 1.1921955087361595
[READ], Operations, 20076
[READ], AverageLatency(us), 10994.088164973102
[READ], MinLatency(us), 168
[READ], MaxLatency(us), 98239
[READ], 95thPercentileLatency(us), 23967
[READ], 99thPercentileLatency(us), 38111
[READ], Return=OK, 20076
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 16546.71875
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 1058815
[CLEANUP], 95thPercentileLatency(us), 22
[CLEANUP], 99thPercentileLatency(us), 34
[UPDATE], Operations, 19924
[UPDATE], AverageLatency(us), 92883.01365187713
[UPDATE], MinLatency(us), 2290
[UPDATE], MaxLatency(us), 1126399
[UPDATE], 95thPercentileLatency(us), 124415
[UPDATE], 99thPercentileLatency(us), 334335
[UPDATE], Return=OK, 19924
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_4 ----------------------------------*
[OVERALL], RunTime(ms), 60506
[OVERALL], Throughput(ops/sec), 661.0914620037682
[TOTAL_GCS_G1_Young_Generation], Count, 45
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1025
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.6940468713846561
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 45
[TOTAL_GC_TIME], Time(ms), 1025
[TOTAL_GC_TIME_%], Time(%), 1.6940468713846561
[READ], Operations, 20068
[READ], AverageLatency(us), 10228.868746262708
[READ], MinLatency(us), 151
[READ], MaxLatency(us), 1746943
[READ], 95thPercentileLatency(us), 18255
[READ], 99thPercentileLatency(us), 73151
[READ], Return=OK, 20068
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 11951.03125
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 764415
[CLEANUP], 95thPercentileLatency(us), 31
[CLEANUP], 99thPercentileLatency(us), 54
[UPDATE], Operations, 19932
[UPDATE], AverageLatency(us), 175268.57906883405
[UPDATE], MinLatency(us), 1639
[UPDATE], MaxLatency(us), 6369279
[UPDATE], 95thPercentileLatency(us), 279807
[UPDATE], 99thPercentileLatency(us), 3084287
[UPDATE], Return=OK, 19932
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_5 ----------------------------------*
[OVERALL], RunTime(ms), 40142
[OVERALL], Throughput(ops/sec), 996.4625579193862
[TOTAL_GCS_G1_Young_Generation], Count, 40
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 675
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.6815305664889642
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 40
[TOTAL_GC_TIME], Time(ms), 675
[TOTAL_GC_TIME_%], Time(%), 1.6815305664889642
[READ], Operations, 19855
[READ], AverageLatency(us), 10076.309594560564
[READ], MinLatency(us), 135
[READ], MaxLatency(us), 411647
[READ], 95thPercentileLatency(us), 24847
[READ], 99thPercentileLatency(us), 38079
[READ], Return=OK, 19855
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 9454.671875
[CLEANUP], MinLatency(us), 5
[CLEANUP], MaxLatency(us), 604671
[CLEANUP], 95thPercentileLatency(us), 20
[CLEANUP], 99thPercentileLatency(us), 24
[UPDATE], Operations, 20145
[UPDATE], AverageLatency(us), 109126.07649540828
[UPDATE], MinLatency(us), 1713
[UPDATE], MaxLatency(us), 2003967
[UPDATE], 95thPercentileLatency(us), 221567
[UPDATE], 99thPercentileLatency(us), 845823
[UPDATE], Return=OK, 20145
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_6 ----------------------------------*
[OVERALL], RunTime(ms), 46147
[OVERALL], Throughput(ops/sec), 866.7952412941253
[TOTAL_GCS_G1_Young_Generation], Count, 47
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 565
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.224348278327952
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 47
[TOTAL_GC_TIME], Time(ms), 565
[TOTAL_GC_TIME_%], Time(%), 1.224348278327952
[READ], Operations, 20025
[READ], AverageLatency(us), 9380.207790262173
[READ], MinLatency(us), 161
[READ], MaxLatency(us), 257791
[READ], 95thPercentileLatency(us), 21039
[READ], 99thPercentileLatency(us), 44319
[READ], Return=OK, 20025
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 9836.90625
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 629247
[CLEANUP], 95thPercentileLatency(us), 18
[CLEANUP], 99thPercentileLatency(us), 19
[UPDATE], Operations, 19975
[UPDATE], AverageLatency(us), 130109.5917396746
[UPDATE], MinLatency(us), 1813
[UPDATE], MaxLatency(us), 2707455
[UPDATE], 95thPercentileLatency(us), 344319
[UPDATE], 99thPercentileLatency(us), 1425407
[UPDATE], Return=OK, 19975
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_7 ----------------------------------*
[OVERALL], RunTime(ms), 50193
[OVERALL], Throughput(ops/sec), 796.9238738469508
[TOTAL_GCS_G1_Young_Generation], Count, 42
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 646
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.2870320562628255
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 42
[TOTAL_GC_TIME], Time(ms), 646
[TOTAL_GC_TIME_%], Time(%), 1.2870320562628255
[READ], Operations, 19756
[READ], AverageLatency(us), 9355.718920834177
[READ], MinLatency(us), 151
[READ], MaxLatency(us), 307967
[READ], 95thPercentileLatency(us), 19887
[READ], 99thPercentileLatency(us), 55871
[READ], Return=OK, 19756
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 10735.140625
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 686591
[CLEANUP], 95thPercentileLatency(us), 19
[CLEANUP], 99thPercentileLatency(us), 23
[UPDATE], Operations, 20244
[UPDATE], AverageLatency(us), 142231.3449911085
[UPDATE], MinLatency(us), 1651
[UPDATE], MaxLatency(us), 2826239
[UPDATE], 95thPercentileLatency(us), 189439
[UPDATE], 99thPercentileLatency(us), 1987583
[UPDATE], Return=OK, 20244
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_8 ----------------------------------*
[OVERALL], RunTime(ms), 50464
[OVERALL], Throughput(ops/sec), 792.6442612555485
[TOTAL_GCS_G1_Young_Generation], Count, 45
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 588
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.1651870640456563
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 45
[TOTAL_GC_TIME], Time(ms), 588
[TOTAL_GC_TIME_%], Time(%), 1.1651870640456563
[READ], Operations, 20013
[READ], AverageLatency(us), 9358.756108529456
[READ], MinLatency(us), 156
[READ], MaxLatency(us), 1311743
[READ], 95thPercentileLatency(us), 18111
[READ], 99thPercentileLatency(us), 35199
[READ], Return=OK, 20013
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 8342.03125
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 533503
[CLEANUP], 95thPercentileLatency(us), 27
[CLEANUP], 99thPercentileLatency(us), 35
[UPDATE], Operations, 19987
[UPDATE], AverageLatency(us), 143599.41617051084
[UPDATE], MinLatency(us), 1497
[UPDATE], MaxLatency(us), 3743743
[UPDATE], 95thPercentileLatency(us), 160127
[UPDATE], 99thPercentileLatency(us), 2492415
[UPDATE], Return=OK, 19987
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_9 ----------------------------------*
[OVERALL], RunTime(ms), 43026
[OVERALL], Throughput(ops/sec), 929.6704318319156
[TOTAL_GCS_G1_Young_Generation], Count, 46
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 497
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.155115511551155
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 46
[TOTAL_GC_TIME], Time(ms), 497
[TOTAL_GC_TIME_%], Time(%), 1.155115511551155
[READ], Operations, 20037
[READ], AverageLatency(us), 9325.052902131058
[READ], MinLatency(us), 145
[READ], MaxLatency(us), 146175
[READ], 95thPercentileLatency(us), 21423
[READ], 99thPercentileLatency(us), 42655
[READ], Return=OK, 20037
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 1724.8125
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 109759
[CLEANUP], 95thPercentileLatency(us), 27
[CLEANUP], 99thPercentileLatency(us), 61
[UPDATE], Operations, 19963
[UPDATE], AverageLatency(us), 122782.22150979312
[UPDATE], MinLatency(us), 2794
[UPDATE], MaxLatency(us), 1970175
[UPDATE], 95thPercentileLatency(us), 332287
[UPDATE], 99thPercentileLatency(us), 936959
[UPDATE], Return=OK, 19963
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_10 ----------------------------------*
[OVERALL], RunTime(ms), 34209
[OVERALL], Throughput(ops/sec), 1169.2829372387384
[TOTAL_GCS_G1_Young_Generation], Count, 42
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 473
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.3826770732848082
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 42
[TOTAL_GC_TIME], Time(ms), 473
[TOTAL_GC_TIME_%], Time(%), 1.3826770732848082
[READ], Operations, 19926
[READ], AverageLatency(us), 9877.302619692864
[READ], MinLatency(us), 158
[READ], MaxLatency(us), 88831
[READ], 95thPercentileLatency(us), 20495
[READ], 99thPercentileLatency(us), 38463
[READ], Return=OK, 19926
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 18338.8125
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 1173503
[CLEANUP], 95thPercentileLatency(us), 23
[CLEANUP], 99thPercentileLatency(us), 40
[UPDATE], Operations, 20074
[UPDATE], AverageLatency(us), 89540.76442163993
[UPDATE], MinLatency(us), 1603
[UPDATE], MaxLatency(us), 446719
[UPDATE], 95thPercentileLatency(us), 142207
[UPDATE], 99thPercentileLatency(us), 255359
[UPDATE], Return=OK, 20074
*---------------------------------- ycsb run end ------------------------------*
experiment end.